//
//  Constant.swift
//  DouDizhu
//
//  Created by Ant on 16/9/14.
//  Copyright © 2016年 Ant. All rights reserved.
//

import Foundation
import UIKit

let SUIT = ["🃏R", "🃏B", "♣️3", "♣️4", "♣️5", "♣️6", "♣️7", "♣️8", "♣️9", "♣️10", "♣️J", "♣️Q", "♣️K", "♣️A", "♣️2", "♦️3", "♦️4", "♦️5", "♦️6", "♦️7", "♦️8", "♦️9", "♦️10", "♦️J", "♦️Q", "♦️K", "♦️A", "♦️2", "♥️3", "♥️4", "♥️5", "♥️6", "♥️7", "♥️8", "♥️9", "♥️10", "♥️J", "♥️Q", "♥️K", "♥️A", "♠️3", "♠️4", "♠️5", "♠️6", "♠️7", "♠️8", "♠️9", "♠️10", "♠️J", "♠️Q", "♠️K", "♠️A", "♠️2"]

let CARD_WIDTH: CGFloat = 55
let CARD_HEIGHT: CGFloat = 80

let DECK_X: CGFloat = 10
let DECK_Y: CGFloat = 100

let DIZHU_X: CGFloat = 10
let DIZHU_Y: CGFloat = 10
let DIZHU_CARD_MARGIN: CGFloat = 15
